Revit 2020 API
DimensionType.UnitType Property
 The unit type of this dimension style.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public UnitType UnitType { get; }
Visual Basic
Public ReadOnly Property UnitType As UnitType
	Get
Visual C++
public:
property UnitType UnitType {
	UnitType get ();
}
Remarks
 The unit type will either be UT_Length, UT_Angle or UT_Slope.
See Also
DimensionType Class
Autodesk.Revit.DB Namespace